# Ch 3: Handling Missing Data

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [3]:
rng = np.random.RandomState(42)
s = pd.Series(rng.randint(0, 10, 4))

In [4]:
s

0    6
1    3
2    7
3    4
dtype: int32

In [72]:
df = pd.DataFrame(rng.randint(0, 10, (3, 4)), columns=list('ABCD'), index=list('ABC'))
df

   A  B  C  D
A  3  1  7  3
B  1  5  5  9
C  3  5  1  9

In [63]:
t = s.copy()
t.index = [1, 2, 3, 4]
t

1    6
2    3
3    7
4    4
dtype: int32

In [73]:
A = pd.DataFrame(rng.randint(0, 10, (2, 2)))
A

   0  1
0  1  9
1  3  7

In [74]:
B = pd.DataFrame(rng.randint(0, 10, (4, 4)))
B

   0  1  2  3
0  6  8  7  4
1  1  4  7  9
2  8  8  0  8
3  6  8  7  0

In [127]:
A + B

     0     1   2   3
0  7.0  17.0 NaN NaN
1  4.0  11.0 NaN NaN
2  NaN   NaN NaN NaN
3  NaN   NaN NaN NaN

In [131]:
print(A)
print(B)

   0  1
0  1  9
1  3  7
   0  1  2  3
0  6  8  7  4
1  1  4  7  9
2  8  8  0  8
3  6  8  7  0

In [134]:
import pandas as pd
import numpy as np

In [165]:
C = A + B
C

     0     1   2   3
0  7.0  17.0 NaN NaN
1  4.0  11.0 NaN NaN
2  NaN   NaN NaN NaN
3  NaN   NaN NaN NaN

In [173]:
C

     0     1   2   3
0  7.0  17.0 NaN NaN
1  4.0  11.0 NaN NaN
2  NaN   NaN NaN NaN
3  NaN   NaN NaN NaN

In [168]:
(A + B).sum()

0    11.0
1    28.0
2     0.0
3     0.0
dtype: float64

In [201]:
c = np.concatenate((a, b))
c = pd.Series(c)

In [204]:
c[7] = None
c

0       1
1       2
2       3
3     NaN
4       1
5       2
6       3
7    None
dtype: object

In [307]:
c[7] = 10
c = c.astype(float)
c[7] = None
c = np.concatenate((a, b))
c

array([1.0, 2.0, 3.0, nan, 1, 2, 3, None], dtype=object)

In [317]:
C = pd.DataFrame([c, c]).T.astype(float)
C

     0    1
0  1.0  1.0
1  2.0  2.0
2  3.0  3.0
3  NaN  NaN
4  1.0  1.0
5  2.0  2.0
6  3.0  3.0
7  NaN  NaN